using CarouselViewChallenge.Models;
using System.Collections.ObjectModel;
using System.ComponentModel;

namespace CarouselViewChallenge.ViewModels
{
    public class ArticleViewModel : INotifyPropertyChanged
    {
        public ObservableCollection<Article> articles { get; set; }

        public ArticleViewModel()
        {
            articles = new ObservableCollection<Article>();

            for (int i = 0; i < 10; i++)
            {
                Article temp = new Article
                {
                    Article_title = $"نص المقالة {i + 1}",
                    Category = $"التصنيف {i + 1}",
                    Image = @"https://hbrarabic.com/wp-content/uploads/2019/09/هارفارد-بزنس-ريفيو-الابتكار-المزعزع.jpg",
                    Content = this.getContent()
                };

                articles.Add(temp);
            }
        }

        public event PropertyChangedEventHandler PropertyChanged;

        private void onPropertyChanged(string propertyName)
        {
            if (PropertyChanged != null)
                PropertyChanged(this, new PropertyChangedEventArgs(propertyName));
        }

        private string getContent()
        {
            return "هذا النص اختبار هذا النص اختبار هذا النص اختبار هذا النص اختبار هذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبارهذا النص اختبار";
        }
    }
}
